homework/hw1/300mm/entrance/poiseuille_flow_axissymetric_distribution_1/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
  (0	0	0)
  (300	0	0)
  (300	10	-0.174524)
  (0	10	-0.174524)
  (300	10	0.174524)
  (0	10	0.174524)
);

blocks
(
  hex (0 1 2 3 0 1 4 5) (300 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
      type	patch;
      faces
      (
	(0 3 5 0)	
      );
    }
    outlet
    {
      type	patch;
      faces
      (
	(1 2 4 1)
      ); 
    }
    walls
    {
      type	wall;
      faces
      (
	(3 2 4 5)
      ); 
    }
    front
    {
      type	wedge;
      faces
      (
	(0 1 4 5)
      ); 
    }
    back
    {
      type	wedge;
      faces
      (
	(0 1 2 3)
      ); 
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
